#+TITLE: Kirjanpidosta: Ledger
#+SETUPFILE: ~/dokumentit/blog/post-setup.org
*** Tapahtumat

Saldot ovat toki usein käytetty toiminto, mutta toinen tärkeä Ledgerin
komento on =register= tai lyhennettynä =reg=.

#+BEGIN_SRC sh :results output
ledger -f ~/tilit reg
#+END_SRC

#+begin_example
14-Jan-01 Kirjanpidon aloitta.. Assets:Tilit:Nordea       1204,45 €    1204,45 €
                                Asset:Tilit:Säästötili     930,00 €    2134,45 €
                                Liabilities:Visa           -32,40 €    2102,05 €
                                Equity:Tilit             -2102,05 €            0
14-Jan-05 Ruokaa                Assets:Tilit:Nordea        -59,30 €     -59,30 €
                                Expenses:Ruokamenot         59,30 €            0
14-Jan-01 Visan lyhennys        Assets:Tilit:Nordea        -32,40 €     -32,40 €
                                Liabilities:Visa            32,40 €            0
14-Jan-16 Palkka                Assets:Tilit:Nordea       1890,90 €    1890,90 €
                                Income:Palkka            -1890,90 €            0
#+end_example

Tämä ei nyt kamalasti hyödytä näin pienen tilikirjan kanssa, mutta
edut alkavat tulla esille, kun tapahtumia on satoja ja pitäisi tutkia
vain viimeisimmän kuukauden juttuja. Tai jos vaikka haluaa katsoa
päivämäärän mukaan lajiteltuna näitä:

#+BEGIN_SRC sh
ledger -f ~/tilit reg --sort date
#+END_SRC

Tapahtumia voi myös suodattaa sopivasti, jos olet etsimässä vain
tiettyjä tapahtumia. Esimerkiksi tapahtuman kuvauksella tai
tapahtumaan liittyvillä tileillä voi rajata vaikka tutkiaksesi vain
ruokaostoksia. Näistä löytyy enemmän ledgerin [[http://www.ledger-cli.org/3.0/doc/ledger3.html][manuaalista]].

Yhden tärkeän voisin ottaa tähän, eli päivämäärien mukaan tehtäviä
rajoitelmia. Optiot =--begin= ja =--end= rajoittavat tapahtumat
annettujen päivämäärien väliin päätepisteet mukaanluettuna. Tässä on
esimerkkinä tapahtumakysely vuoden ensimmäiseltä viikolta. Palkka ei
ole ehtinyt tulla:

#+BEGIN_SRC sh :results output 
ledger -f ~/tilit --begin 2014-01-01 --end 2014-01-07 reg
#+END_SRC

#+RESULTS:
: 14-Jan-01 Kirjanpidon aloitta.. Assets:Tilit:Nordea       1204,45 €    1204,45 €
:                                 Asset:Tilit:Säästötili     930,00 €    2134,45 €
:                                 Liabilities:Visa           -32,40 €    2102,05 €
:                                 Equity:Tilit             -2102,05 €            0
: 14-Jan-05 Ruokaa                Assets:Tilit:Nordea        -59,30 €     -59,30 €
:                                 Expenses:Ruokamenot         59,30 €            0
: 14-Jan-01 Visan lyhennys        Assets:Tilit:Nordea        -32,40 €     -32,40 €
:                                 Liabilities:Visa            32,40 €            0

Muutama erikoistermikin löytyy, jolla säästyy vähän naputtelua.
Nykyisen kalenterikuukauden aikana (eli ensimmäisestä päivästä alkaen)
tehdyt tapahtumat:

#+BEGIN_SRC sh
ledger -f ~/tilit --begin 'this month' reg
#+END_SRC

Ja viimeisimmän kuukauden eli 30 päivän tapahtumat:

#+BEGIN_SRC sh
ledger -f ~/tilit --begin 'last month' reg
#+END_SRC

Mainitut asetukset käyvät kaikki niin saldoihin kuin
tapahtumakyselyihin. Erityisesti edellä mainitut =--current= ja
=--begin= ja =--end= -optiot toimivat hyvin.

